app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" INNER JOIN "relationships" ON "profiles"."id" = "relationships"."profile_id" WHERE "relationships"."competitor_id" = $1 ORDER BY "profiles"."followers" DESC LIMIT $2 OFFSET $3  [["competitor_id", 1550748818], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "profiles" INNER JOIN "relationships" ON "profiles"."id" = "relationships"."profile_id" WHERE "relationships"."competitor_id" = $1  [["competitor_id", 1550748818]]
---
    def index
        @profiles = Competitor.find(params["competitor_id"]).profiles.order(followers: :desc).page(params[:page])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 246140605], ["LIMIT", 1]]
---
    def show
        @profile = Profile.find(params[:profile_id])

SELECT  "competitors".* FROM "competitors" WHERE "competitors"."id" = $1 LIMIT $2  [["id", 1550748818], ["LIMIT", 1]]
---
    def download
        @competitor = Competitor.find(params["competitor_id"])

SELECT  "profiles".* FROM "profiles" INNER JOIN "relationships" ON "profiles"."id" = "relationships"."profile_id" WHERE "relationships"."competitor_id" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["competitor_id", 1550748818], ["LIMIT", 1000]]
---
    def csv_lines
        Enumerator.new do |csv_file|
            csv_file << Profile.csv_header.to_s

            @competitor.profiles.find_in_batches(batch_size: 1000) do |profiles|

SELECT  1 AS one FROM "relationships" WHERE "relationships"."competitor_id" = $1 AND "relationships"."profile_id" = $2 LIMIT $3  [["competitor_id", 1550748818], ["profile_id", 246140605], ["LIMIT", 1]]
---
    def profile_competitor_relationship_exists
        redirect_to controller: 'errors', :action => 'not_found' if Relationship.where(competitor_id: params["competitor_id"], profile_id: params["profile_id"]).empty?